Repository: mun33b-exe/demo-repo
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: SmartFarm
ur: سمارٹ فارم

source: Home
ur: ہوم

source: Market
ur: مارکیٹ

source: Community
ur: کمیونٹی

source: Profile
ur: پروفائل

source: Login
ur: لاگ ان

source: Sign Up
ur: سائن اپ

source: Email
ur: ای میل

source: Password
ur: پاس ورڈ

source: Confirm Password
ur: پاس ورڈ کی تصدیق کریں

source: Sign In
ur: سائن ان

source: Create Account
ur: اکاؤنٹ بنائیں

# alreadyHaveAccount
source: Already have an account?
ur: پہلے سے اکاؤنٹ ہے؟

# dontHaveAccount
source: Don't have an account?
ur: اکاؤنٹ نہیں ہے؟

source: Sign Out
ur: سائن آؤٹ

source: Theme
ur: تھیم

source: Language
ur: زبان

source: Light
ur: روشن

source: Dark
ur: اندھیرا

source: System
ur: سسٹم

source: English
ur: انگریزی

# urdu
source: Urdu (اردو)
ur: اردو

source: Farmer
ur: کسان

source: No Email
ur: ای میل نہیں

source: Marketplace
ur: مارکیٹ پلیس

source: All Products
ur: تمام مصنوعات

source: My Products
ur: میری مصنوعات

# noProductsAvailable
source: No products available in the market.
ur: مارکیٹ میں کوئی مصنوعات دستیاب نہیں۔

# beFirstToList
source: Be the first to list a product!
ur: پہلی مصنوعات لسٹ کرنے والے بنیں!

# haventListedProducts
source: You haven't listed any products yet.
ur: آپ نے ابھی تک کوئی مصنوعات لسٹ نہیں کیں۔

# tapToAddProduct
source: Tap the + button to add your first product!
ur: پہلی مصنوعات شامل کرنے کے لیے + بٹن پر ٹیپ کریں!

source: Error loading products
ur: مصنوعات لوڈ کرنے میں خرابی

source: Sell Product
ur: مصنوعات فروخت کریں

source: Edit Product
ur: مصنوعات میں ترمیم کریں

source: Product Name
ur: مصنوعات کا نام

source: Description
ur: تفصیل

source: Price (PKR)
ur: قیمت (پاکستانی روپے)

source: List Product
ur: مصنوعات لسٹ کریں

source: Update Product
ur: مصنوعات اپ ڈیٹ کریں

# pleaseSelectImage
source: Please select an image
ur: براہ کرم ایک تصویر منتخب کریں

# productAddedSuccess
source: Product added successfully!
ur: مصنوعات کامیابی سے شامل کی گئی!

# productUpdatedSuccess
source: Product updated successfully!
ur: مصنوعات کامیابی سے اپ ڈیٹ کی گئی!

# productDeletedSuccess
source: Product deleted successfully!
ur: مصنوعات کامیابی سے حذف کی گئی!

# errorDeletingProduct
source: Error deleting product: {error}
ur: مصنوعات حذف کرنے میں خرابی: {error}

source: Delete Product
ur: مصنوعات حذف کریں

# confirmDeleteProduct
source: Are you sure you want to delete this product?
ur: کیا آپ واقعی اس مصنوعات کو حذف کرنا چاہتے ہیں؟

source: Cancel
ur: منسوخ کریں

source: Delete
ur: حذف کریں

source: Seller
ur: فروخت کنندہ

source: Unknown
ur: نامعلوم

# communityTitle
source: Community
ur: کمیونٹی

source: Feed
ur: فیڈ

source: My Posts
ur: میری پوسٹس

# noPostsYet
source: No posts yet. Be the first!
ur: ابھی تک کوئی پوسٹس نہیں۔ پہلے بنیں!

# startConversation
source: Start a conversation by posting below!
ur: نیچے پوسٹ کر کے گفتگو شروع کریں!

# haventPosted
source: You haven't posted anything yet.
ur: آپ نے ابھی تک کچھ پوسٹ نہیں کیا۔

# shareThoughts
source: Share your thoughts with the community!
ur: کمیونٹی کے ساتھ اپنے خیالات شیئر کریں!

source: Error loading posts
ur: پوسٹس لوڈ کرنے میں خرابی

source: Ask something...
ur: کچھ پوچھیں...

source: Likes
ur: لائکس

source: Edit
ur: ترمیم

source: Edit Post
ur: پوسٹ میں ترمیم کریں

source: Enter new content
ur: نیا مواد درج کریں

source: Update
ur: اپ ڈیٹ

# postUpdatedSuccess
source: Post updated successfully!
ur: پوسٹ کامیابی سے اپ ڈیٹ کی گئی!

# errorUpdatingPost
source: Error updating post: {error}
ur: پوسٹ اپ ڈیٹ کرنے میں خرابی: {error}

# postDeletedSuccess
source: Post deleted successfully!
ur: پوسٹ کامیابی سے حذف کی گئی!

# errorDeletingPost
source: Error deleting post: {error}
ur: پوسٹ حذف کرنے میں خرابی: {error}

source: Delete Post
ur: پوسٹ حذف کریں

# confirmDeletePost
source: Are you sure you want to delete this post?
ur: کیا آپ واقعی اس پوسٹ کو حذف کرنا چاہتے ہیں؟

# errorUpdatingLike
source: Error updating like: {error}
ur: لائک اپ ڈیٹ کرنے میں خرابی: {error}

source: Weather
ur: موسم

source: Crop Guidance
ur: فصل کی رہنمائی

source: Government Schemes
ur: حکومتی اسکیمیں

source: Wheat
ur: گندم

source: Rice
ur: چاول

source: Cotton
ur: کپاس

source: Current Temperature
ur: موجودہ درجہ حرارت

source: Today
ur: آج

# pleaseEnterName
source: Please enter a name
ur: براہ کرم نام درج کریں

# pleaseEnterPrice
source: Please enter a price
ur: براہ کرم قیمت درج کریں

source: Error
ur: خرابی

source: User not logged in
ur: صارف لاگ ان نہیں ہے
